from config.config import app

from pyrogram import filters


@app.on_message(filters.command(["start", "start@edbo_fict_bot"]))
def greeting(client, message):
    message.reply_text(text="""
Дороу 👋

Цей бот призначений для розрахунку непрохідного бала зі спеціальностей ФІОТ КПІ

<i><b>Важливо:</b> не плутай прохідний і НЕпрохідний бали, це різні речі. 
Непрохідний бал - бал n-ої людини з 1 пріорітетом, де n - кількість бюджетних місць</i>

Для розрахунку непрохідного бала з усіх спеціальностей відправ мені команду /marks

Якщо хочеш дізнатись інформацію про конкретну спеціальність, тицяй:
<b>Денна форма навчання</b>
/121 
/123 
/126
<b>Заочна форма навчання</b>
/121_zaochka

<i>Якщо бот довго не відповідає, то все нормально, це означає що сайт vstup.edbo.gov.ua тимчасово не працює :)</i>
""", reply_to_message_id=message.id)

